app/Controllers/Home.php

    public function process ($mode ){

        if($mode == 'register'){
            $username = $this->request->getPost('uname');
            $password = $this->request->getPost('pass');


            $hashed_password = password_hash($password, PASSWORD_DEFAULT);

            $db = \Config\Database::connect();
            $builder = $db->table('users');

            $data = [

                'username' => $username,
                'passw' => $hashed_password,
            ];

            $builder->insert($data);
---
INSERT INTO `users` (`username`, `passw`) VALUES ('hanabi', '$2y$10$ujS/Um3TNKGiyC0Lg6S9lOsE0Bux7Yy4f6hJQWGEXDkWmC5yOY8kS')